In [1]:
import pandas as pd

obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [3]:
obj.reindex(['a', 'b', 'c', 'd']) #重新排序索引

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [6]:
obj.reindex(['c', 'd']) #選取索引

c    3.6
d    4.5
dtype: float64

In [11]:
#dataFrame
import numpy as np

frame = pd.DataFrame(np.arange(9).reshape(3,3),
                    index=['a', 'b', 'c'],
                    columns=['台北','台中','高雄'])
frame

   台北  台中  高雄
a   0   1   2
b   3   4   5
c   6   7   8

In [14]:
frame.reindex(['a','c']) #選取需要的列

   台北  台中  高雄
a   0   1   2
c   6   7   8

In [16]:
frame.reindex(['a','c'],columns=['台北','台中'])

   台北  台中
a   0   1
c   6   7

In [18]:
#drop()
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj.drop('c')

d    4.5
b    7.2
a   -5.3
dtype: float64

In [21]:
obj.drop(['a', 'c'])

d    4.5
b    7.2
dtype: float64

In [24]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
                    index=['台北','台中','高雄','台南'],
                    columns=['one', 'two', 'three', 'four'])
frame

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
高雄    8    9     10    11
台南   12   13     14    15

In [26]:
frame.drop(index=['台北','台中'],columns=['one','two'])

    three  four
高雄     10    11
台南     14    15

In [27]:
frame

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
高雄    8    9     10    11
台南   12   13     14    15

In [28]:
#subscript->[]
#使用索引,
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [29]:
obj['d']

4.5

In [31]:
obj[0]

4.5

In [33]:
obj[['d','a','c']]

d    4.5
a   -5.3
c    3.6
dtype: float64

In [36]:
#slice [:]
obj[0:3]

d    4.5
b    7.2
a   -5.3
dtype: float64

In [38]:
#過濾內容(使用比較運算子)
obj > 2

d     True
b     True
a    False
c     True
dtype: bool

In [40]:
obj[obj>2]

d    4.5
b    7.2
c    3.6
dtype: float64

In [41]:
#dataFrame使用subscript
#索引
frame = pd.DataFrame(np.arange(16).reshape(4,4),
                    index=['台北','台中','高雄','台南'],
                    columns=['one', 'two', 'three', 'four'])
frame

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
高雄    8    9     10    11
台南   12   13     14    15

In [44]:
#字串索引取出的是一欄
frame['one']

台北     0
台中     4
高雄     8
台南    12
Name: one, dtype: int64

In [46]:
frame[['one']]

    one
台北    0
台中    4
高雄    8
台南   12

In [48]:
frame[['one','two']]

    one  two
台北    0    1
台中    4    5
高雄    8    9
台南   12   13

In [51]:
#取出列,只可以使用slice[:],這不常用,一般使用iloc,loc取出
frame[0:2]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [53]:
#使用loc[]
frame.loc[['台北','台南']]

    one  two  three  four
台北    0    1      2     3
台南   12   13     14    15

In [55]:
#使用iloc[]
frame.iloc[[0,3]]

    one  two  three  four
台北    0    1      2     3
台南   12   13     14    15

In [57]:
#使用slice iloc[:]
frame.iloc[:3]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
高雄    8    9     10    11

In [61]:
#同時取出欄和列
frame[['one', 'two', 'three']].iloc[:3]

    one  two  three
台北    0    1      2
台中    4    5      6
高雄    8    9     10

In [63]:
#同時取出欄和列
frame.loc[['台北','台中','高雄'],['one', 'two', 'three']]

    one  two  three
台北    0    1      2
台中    4    5      6
高雄    8    9     10

In [65]:
#過濾內容
frame['one'] == 8

台北    False
台中    False
高雄     True
台南    False
Name: one, dtype: bool

In [66]:
frame[frame['one'] == 8]

    one  two  three  four
高雄    8    9     10    11